# coding=utf8
# 错误代码配置

KPI_ERROR_MESSAGES = {
    'userLogin':{
        100: '用户验证通过',
        101: '用户验证不通过,密码错误',
        102: '用户验证不通过,用户不存在'
    },
    'userRegister':{
        103: '用户注册通过,类型:普通用户',
        104: '用户注册通过,类型:管理员用户',
        105: '用户注册通过,类型:超级用户',
        106: '用户注册不通过,用户已存在',
        107: '用户注册不通过,类型错误'
    },
    'refreshToken':{
        108: 'Token刷新成功',
        109: 'Token刷新失败,令牌无效'
    },
    'global':{
        200: '数据获取成功',
        201: '数据获取失败,无数据',
        202: '数据获取失败,参数无效',
        203: '数据获取失败,范围错误',
        300: '数据提交成功,类型:创建数据',
        301: '数据提交成功,类型:修改数据',
        302: '数据提交成功,类型:删除数据',
        303: '数据提交失败,已存在数据',
        304: '数据提交失败,校验不通过',
        305: '数据提交失败,关联项不存在',
        306: '数据提交失败,存在多条相同数据',
        307: '数据提交成功'
    }
}